import streamlit as st
from numpy.random import default_rng as rng
import pandas as pd
import plotly.graph_objects as go
import pandas as pd


container = st.container(border = True, height = 140)
container.header("📊인프라 격차 분석")
container.text("지역별 충전 인프라 및 친환경차 현황 비교")


col1, col2, col3, col4 = st.columns(4)
col1.metric("전기차 등록 대수", "2,244대", border =True, width = 250, height="content")
col2.metric("수소차 등록 대수", "126대", border =True, width = 250, height="content")
col3.metric("총 충전기 수", "215기", border =True, width = 250, height="content")
col4.metric("전기차량 충전기", "0.10 기/대", border =True, width = 250, height="content")


df = pd.DataFrame({
    "지역": ["경기", "서울", "인천", "부산", "울산", "대전"],
    "전기차 수": [200,300,100,80,70,60],   # 차량 수
    "충전기 수": [100,120,150,170,200,180], # 충전기 수
})

fig = go.Figure()

# 1️⃣ 전기차 (막대, 왼쪽)
fig.add_trace(go.Bar(
    x=df["지역"],
    y=df["전기차 수"],
    name="전기차",
    yaxis="y1",
    opacity=0.7
))

# 3️⃣ 충전기 (막대, 오른쪽)
fig.add_trace(go.Bar(
    x=df["지역"],
    y=df["충전기 수"],
    name="충전기",
    yaxis="y2",
    opacity=0.7
))

fig.update_layout(
    title="전기차와 충전기 수요량",
    xaxis=dict(title="지역"),

    yaxis=dict(
        title="전기차 등록 대수",
        side="left"
    ),

    yaxis2=dict(
        title="충전기 수",
        overlaying = "y",
        side="right"
    ),

    barmode="group"
)

st.plotly_chart(fig, use_container_width=True)

df = pd.DataFrame(
    [
        {"지역": df["지역"][0], "전기차": df["전기차 수"][0], "충전기": df["충전기 수"][0],"전기차당 충전기":df["충전기 수"][0]/df["전기차 수"][0]},
        {"지역": df["지역"][1], "전기차": df["전기차 수"][1], "충전기": df["충전기 수"][1],"전기차당 충전기":df["충전기 수"][1]/df["전기차 수"][1]},
        {"지역": df["지역"][2], "전기차": df["전기차 수"][2], "충전기": df["충전기 수"][2],"전기차당 충전기":df["충전기 수"][2]/df["전기차 수"][2]},
        {"지역": df["지역"][3], "전기차": df["전기차 수"][3], "충전기": df["충전기 수"][3],"전기차당 충전기":df["충전기 수"][3]/df["전기차 수"][3]},
        {"지역": df["지역"][4], "전기차": df["전기차 수"][4], "충전기": df["충전기 수"][4],"전기차당 충전기":df["충전기 수"][4]/df["전기차 수"][4]},
        {"지역": df["지역"][5], "전기차": df["전기차 수"][5], "충전기": df["충전기 수"][5],"전기차당 충전기":df["충전기 수"][5]/df["전기차 수"][5]},
    ]
)

st.dataframe(df, use_container_width=True)