import streamlit as st
import pandas as pd
from db import query
import numpy as np


st.title("보조금 전체 분석")
st.subheader("지역별 보조금 지원 현황 및 정책 효과 분석")


col1, col2, col3 = st.columns(3)

col1.metric("평균 전기차 보조금", 380,border=True )
col2.metric("평균 수소차 보조금", 380,border=True )
col3.metric("최고 보조금 지역", "울산",border=True)



st.markdown("지역별 보조금 지급")
st.caption('2024년 기준')

#전기차 수소차 지역별 보조금 지급
data1 = {
    "region" : ["서울","부산","대구","인천","광주","대전","울산","세종","경기","강원","충북","충남","전북","전남","경북","경남","제주"],
    "수소차 보조금" : [15000, 8200, 6300, 7400, 4100, 5200, 3900,1800, 21000, 3200, 2800, 3500,2900, 3300, 4700, 5600, 2600],
    "전기차 보조금" : [15000, 8200, 6300, 7400, 4100, 5200, 3900,1800, 21000, 3200, 2800, 3500,2900, 3300, 4700, 5600, 2600],
}
df = pd.DataFrame(data1)



st.bar_chart(df, x ="region" ,y = ["수소차 보조금","전기차 보조금"])



st.markdown("보조금 vs전기차 보급 상관관계")
st.caption('정책 효과 분석')

data2 = {
    "region" : ["서울","부산","대구","인천","광주","대전","울산","세종","경기","강원","충북","충남","전북","전남","경북","경남","제주"],
    "보조금 지급" : [15000, 8200, 6300, 7400, 4100, 5200, 3900,1800, 21000, 3200, 2800, 3500,2900, 3300, 4700, 5600, 2600],
    "전기차 등록 대수" : [15000, 8200, 6300, 7400, 4100, 5200, 3900,1800, 21000, 3200, 2800, 3500,2900, 3300, 4700, 5600, 2600]
}
df2 = pd.DataFrame(data2)

st.scatter_chart(df2, x="보조금 지급", y= "전기차 등록 대수")


st.header("지역별 보조금 상세")

def region_subsidy_data():
    return pd.DataFrame(
            np.random.randint(100, 1000, size=(18, 4)),
            index=[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17],
            columns=['지역','전기차 보조금','수소차 보조금','함계']  
    )

rg = region_subsidy_data()
st.dataframe(rg,)